#### Dev Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rcomarceli-tutorial/dev-resume/runs/run-QhxH2joF2Jb2sZEu

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
module.backend.data.archive_file.lambda_code: Reading...
random_pet.website_bucket_name: Refreshing state... [id=dev-resume-website-directly-live-lemming]
random_pet.lambda_bucket_name: Refreshing state... [id=dev-resume-lambda-inherently-magical-bluegill]
module.backend.data.archive_file.lambda_code: Read complete after 0s [id=6b4c1c7a6d7cc540760ae5292e204aa4e3af7e26]
module.dns.cloudflare_zone_settings_override.application: Refreshing state... [id=733fd37e491cff26d1ef7600717eca24]
module.backend.aws_iam_role.lambda_exec: Refreshing state... [id=dev_resume_lambda_iam_role]
module.backend.aws_apigatewayv2_api.lambda: Refreshing state... [id=gouieeb2a0]
module.backend.aws_s3_bucket.lambda_bucket: Refreshing state... [id=dev-resume-lambda-inherently-magical-bluegill]
module.backend.aws_dynamodb_table.update_visitor_counter: Refreshing state... [id=dev_resume_db]
module.frontend.aws_s3_bucket.application: Refreshing state... [id=dev-resume-website-directly-live-lemming]
module.backend.aws_iam_policy.database_access: Refreshing state... [id=arn:aws:iam::681163022059:policy/dev_resume_lambda_Iam_Policy]
module.backend.aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/vendedlogs/dev_resume_api]
module.backend.aws_apigatewayv2_stage.lambda: Refreshing state... [id=dev_v1]
module.backend.aws_s3_bucket_acl.lambda_bucket: Refreshing state... [id=dev-resume-lambda-inherently-magical-bluegill,private]
module.backend.aws_s3_object.lambda_code: Refreshing state... [id=lambda_code.zip]
module.frontend.aws_s3_bucket_website_configuration.application: Refreshing state... [id=dev-resume-website-directly-live-lemming]
module.frontend.aws_s3_object.css: Refreshing state... [id=index.css]
module.frontend.data.aws_iam_policy_document.application: Reading...
module.frontend.data.aws_iam_policy_document.application: Read complete after 0s [id=3699393706]
module.frontend.aws_s3_bucket_policy.application: Refreshing state... [id=dev-resume-website-directly-live-lemming]
module.dns.cloudflare_worker_script.change_header: Refreshing state... [id=terraform-change-resume-host-header-dev]
module.dns.cloudflare_record.site_cname: Refreshing state... [id=b1c0cc4570fad677bb7bc4dd226e69c4]
module.frontend.aws_s3_object.html_index: Refreshing state... [id=index.html]
module.backend.aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=dev_resume_lambda_iam_role-20230213214552535700000001]
module.backend.aws_iam_role_policy_attachment.database_access: Refreshing state... [id=dev_resume_lambda_iam_role-20230213214604788700000002]
module.backend.aws_lambda_function.update_visitor_counter: Refreshing state... [id=dev_updatevisitorcounter]
module.backend.aws_cloudwatch_log_group.update_visitor_counter: Refreshing state... [id=/aws/lambda/dev_updatevisitorcounter]
module.backend.aws_lambda_permission.api_gw: Refreshing state... [id=dev_resume_lambda_permission]
module.backend.aws_apigatewayv2_integration.update_visitor_counter: Refreshing state... [id=fd9kya9]
module.backend.aws_apigatewayv2_route.update_visitor_counter: Refreshing state... [id=barv0j0]
module.dns.cloudflare_worker_route.change_header: Refreshing state... [id=7f7ed78d196246399fde1189cc9350d4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_rate_limit.example will be created
  + resource "cloudflare_rate_limit" "example" {
      + description = "example rate limit for a zone"
      + disabled    = false
      + id          = (known after apply)
      + period      = 5
      + threshold   = 10
      + zone_id     = "733fd37e491cff26d1ef7600717eca24"

      + action {
          + mode    = "simulate"
          + timeout = 10

          + response {
              + body         = "custom response body"
              + content_type = "text/plain"
            }
        }

      + correlate {
          + by = "nat"
        }

      + match {
          + request {
              + methods     = (known after apply)
              + schemes     = (known after apply)
              + url_pattern = (known after apply)
            }

          + response {
              + headers        = (known after apply)
              + origin_traffic = (known after apply)
              + statuses       = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @Rcomarceli, Action: `pull_request`*